app/Controllers/Auth.php

    public function check()
    {
        $session = session();
        $model = new AdminModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $admin = $model->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1