app/Controllers/CourseController.php

 public function create()
{
    $courseModel = new \App\Models\CourseModel();

    $data = [
        'courses' => $courseModel->findAll() // form + list
    ];
---
SELECT *
FROM `courses`