app/Controllers/StudentContentController.php

SELECT *
FROM `courses`
SELECT *
FROM `papers`
SELECT *
FROM `units`
SELECT *
FROM `chapters`
---
    public function index()
{
    $courseModel = new \App\Models\CourseModel();
    $paperModel = new \App\Models\PaperModel();
    $unitModel = new \App\Models\UnitModel();
    $chapterModel = new \App\Models\ChapterModel();

    $data = [
        'courses' => $courseModel->findAll(),
        'papers' => $paperModel->findAll(),
        'units' => $unitModel->findAll(),
        'chapters' => $chapterModel->findAll(),
    ];

SELECT *
FROM `chapters`
WHERE `slug` = 'e-governance-mp-online-services-uidi-aadhar'
 LIMIT 1
SELECT *
FROM `courses`
SELECT *
FROM `papers`
SELECT *
FROM `units`
SELECT *
FROM `chapters`
---
    public function viewChapter($slug)
    {
        $chapterModel = new ChapterModel();
        $chapter = $chapterModel->where('slug', $slug)->first();

        if (!$chapter) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Chapter not found");
        }

        $courseModel = new CourseModel();
        $paperModel = new PaperModel();
        $unitModel = new UnitModel();

        $data = [
            'chapter' => $chapter,
            'courses' => $courseModel->findAll(),
            'papers' => $paperModel->findAll(),
            'units' => $unitModel->findAll(),
            'chapters' => $chapterModel->findAll()