app/Models/ChapterModel.php

    public function getChaptersWithHierarchy()
    {
        return $this->db->table('chapters')
            ->select('chapters.*, units.name as unit_name, papers.name as paper_name, courses.name as course_name')
            ->join('units', 'chapters.unit_id = units.id')
            ->join('papers', 'units.paper_id = papers.id')
            ->join('courses', 'papers.course_id = courses.id')
            ->get()
            ->getResult();
---
SELECT `chapters`.*, `units`.`name` as `unit_name`, `papers`.`name` as `paper_name`, `courses`.`name` as `course_name`
FROM `chapters`
JOIN `units` ON `chapters`.`unit_id` = `units`.`id`
JOIN `papers` ON `units`.`paper_id` = `papers`.`id`
JOIN `courses` ON `papers`.`course_id` = `courses`.`id`